---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.FileArgumentAlreadyExistsException
source: html/bd370921-90a7-527e-4f16-f133adcd68d2.htm
---
# FileArgumentAlreadyExistsException Members

Retrieves data needed to serialize the target object.